1. فرض کنید یک برنامه برای مدیریت نمرات دانشجویان طراحی می کنید. لیستی از نمرات اختیاری شماست و باید بالاترین و پایین ترین نمره را پیدا وچاپ کنید.
2. . تعداد دانشجویان را دریافت می‌کنیم و در متغیر n قرار می‌دهیم.
۲. نمره‌های دانشجویان را دریافت می‌کنیم و در آرایه A قرار می‌دهیم.
۳. دو متغیر max و min را به‌ ترتیب برابر اولین نمره قرار می‌دهیم.
max = A[1]
min = A[1]
۴. از دانشجوی دوم تا دانشجوی nام تکرار می‌کنیم:
اگر:
A[i] > max
آنگاه:
max = A[i]
اگر:
A[i] < min
آنگاه:
min = A[i]
۵. مقادیر max و min را چاپ می‌کنیم.
فرض کنیم نمره‌ها به این صورت باشند:
A = [15, 18, 12, 20, 16]

| i | A[i] | max | min |
|---|---|---|---|
| 1 | 15 | 15 | 15 |
| 2 | 18 | 18 | 15 |
| 3 | 12 | 18 | 12 |
| 4 | 20 | 20 | 12 |
| 5 | 16 | 20 | 12 |
خروجی:
Maximum = 20
Minimum = 12
پیچیدگی زمانی:
   O(n)
چون هر نمره فقط یک بار بررسی می‌شود.
