1.یک  برنامه برای برسی رشته طراحی کنید که تشخیص دهد ایا رشته از دو طرف به یک شکل خوانده میشود  یا خیر مثلlevelیا به فارسی کبک .
 ۱. یک رشته از ورودی دریافت می‌کنیم.

۲. تعداد حروف رشته را در متغیر n قرار می‌دهیم.

۳. حرف اول رشته را با حرف آخر آن مقایسه می‌کنیم.

۴. اگر دو حرف برابر بودند، حرف دوم را با حرف یکی مانده به آخر مقایسه می‌کنیم و این کار را ادامه می‌دهیم.

۵. اگر در هر مرحله دو حرف برابر نبودند، چاپ کن  رشته متقارن نیست ، الگوریتم را پایان می‌دهیم.

۶. اگر تمام حروف متناظر برابر بودند  چاپ کن  رشته متقارن است 

 مثال :

رشته ورودی: radar

مرحله اول: حرف اول r را با حرف آخر r مقایسه می‌کنیم. برابر هستند.

مرحله دوم: حرف دوم a را با حرف یکی مانده به آخر a مقایسه می‌کنیم. برابر هستند.

مرحله سوم: به حرف وسط رشته می‌رسیم.

نتیجه: رشته متقارن است.

 پیچیدگی زمانی

O(n)

زیرا در بدترین حالت، حروف رشته را از دو طرف بررسی می‌کنیم.
